---
title: "Test Org modes file"
author: "Chunyang Xu"
date: "2017-08-20T01:05:28+08:00"
---

** 代码高亮

Emacs Lisp:

#+BEGIN_SRC elisp
  (defun chunyang-quit-init-el ()
    "Call it from init file to quit loading immediately."
    (when load-in-progress
      (with-current-buffer " *load*"
        (message "%s:%s:%s"
                 load-file-name
                 (line-number-at-pos)
                 (buffer-substring-no-properties
                  (line-beginning-position)
                  (line-end-position)))
        (goto-char (point-max)))))
#+END_SRC

注意不要用 ~emacs-lisp~ ，因为 Pandoc 会[[https://github.com/jgm/pandoc/blob/ac18ff90b22c2a8f8b829acb9139477ee7b02954/src/Text/Pandoc/Readers/Org/Shared.hs#L89][自动]]把它换成 ~commonlisp~ ，可以使用 ~elisp~ 。

C:

#+NAME: hello-world
#+BEGIN_SRC C
  /* Hello World program */

  #include <stdio.h>

  int main ()
  {
      printf("Hello World");
      return 0;
  }
#+END_SRC

#+RESULTS: hello-world
: Hello World
